**`teams/oasys/oracle_db`** terragrunt plan on `push` event [#58](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/oasys-oracle-db"
        name         = "oasys_oracle_db"
      ~ tags         = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "os-version"                   = "rhel 7.9" -> "rhel 8.5"
            # (9 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "os-version"                   = "rhel 7.9" -> "rhel 8.5"
            # (9 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/oasys-oracle-db" -> (known after apply)
      ~ date_created                     = "2023-02-09T15:49:01.146Z" -> (known after apply)
      ~ date_last_run                    = "2023-02-14T09:53:15.951Z" -> (known after apply)
      ~ date_next_run                    = "2023-03-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-02-09T15:49:01.146Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/oasys-oracle-db" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/oasys-oracle-db/0.0.1" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/oasys-oracle-db-0-0-1" -> (known after apply)
        name                             = "oasys_oracle_db"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "os-version"                   = "rhel 7.9" -> "rhel 8.5"
            # (9 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "os-version"                   = "rhel 7.9" -> "rhel 8.5"
            # (9 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/oasys-oracle-db/0.0.1" -> (known after apply)
      ~ date_created      = "2023-02-09T15:48:59.151Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/oasys-oracle-db/0.0.1" -> (known after apply)
        name              = "oasys_oracle_db"
      ~ owner             = "374269020027" -> (known after apply)
      ~ parent_image      = (sensitive) # forces replacement
      ~ platform          = "Linux" -> (known after apply)
      ~ tags              = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "os-version"                   = "rhel 7.9" -> "rhel 8.5"
            # (9 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "os-version"                   = "rhel 7.9" -> "rhel 8.5"
            # (9 unchanged elements hidden)
        }
      ~ user_data_base64  = "" -> (known after apply)
      ~ version           = "0.0.1" -> "0.0.2" # forces replacement
      - working_directory = "" -> null
        # (1 unchanged attribute hidden)

        # (3 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/oasys-oracle-db-0-0-1" -> (known after apply)
      ~ date_created                  = "2023-02-09T15:48:57.553Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/oasys-oracle-db-0-0-1" -> (known after apply)
      ~ name                          = "oasys_oracle_db_0_0_1" -> "oasys_oracle_db_0_0_2" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "os-version"                   = "rhel 7.9" -> "rhel 8.5"
            # (9 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "os-version"                   = "rhel 7.9" -> "rhel 8.5"
            # (9 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "image-recipe"                 = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "infrastructure-configuration" = "oasys_oracle_db/0.0.1" -> "oasys_oracle_db/0.0.2"
          ~ "os-version"                   = "rhel 7.9" -> "rhel 8.5"
            # (9 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

```
